[Killed] ArrowFunction
src/components/Form/Form.tsx:15:37
 import FormField from './FormField';
 import SubmitButton from './SubmitButton';
 
-const DynamicNotification = dynamic(() => import('../Notification'));
+const DynamicNotification = dynamic(() => undefined);
 
 export default function Form() {
killedBy: email validation renders email input with valid value
statusReason: TypeError: Cannot read properties of undefined (reading 'then')

[Timeout] BlockStatement
src/components/Form/Form.tsx:23:19
   const [errors, setErrors] = useState<FieldError>({});
   const { user, error, updateUser } = useUser(1);
 
-  useEffect(() => {
-    if (user) {
-      setFormData(user);
-    } else if (error) {
-      const { status, message } = error;
-      setNotification({ status, message });
-    }
-  }, [user, error]);
+  useEffect(() => {}, [user, error]);
 
   const handleChange = (e: FormFieldEvent) => {

[Killed] ConditionalExpression
src/components/Form/Form.tsx:24:9
   const { user, error, updateUser } = useUser(1);
 
   useEffect(() => {
-    if (user) {
+    if (true) {
       setFormData(user);
     } else if (error) {
killedBy: Integration tests for fetching, populating, and updating user data in the form component. handles error returned by useUser and sets notification
statusReason: TypeError: Cannot read properties of null (reading 'name')

[Timeout] BlockStatement
src/components/Form/Form.tsx:24:15
   const { user, error, updateUser } = useUser(1);
 
   useEffect(() => {
-    if (user) {
-      setFormData(user);
-    } else if (error) {
+    if (user) {} else if (error) {
       const { status, message } = error;
       setNotification({ status, message });

[Killed] ConditionalExpression
src/components/Form/Form.tsx:26:16
   useEffect(() => {
     if (user) {
       setFormData(user);
-    } else if (error) {
+    } else if (true) {
       const { status, message } = error;
       setNotification({ status, message });
killedBy: Integration tests for fetching, populating, and updating user data in the form component. handles error returned by useUser and sets notification
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="notification"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="formComponentWrapper"
    >

[Killed] BlockStatement
src/components/Form/Form.tsx:26:23
   useEffect(() => {
     if (user) {
       setFormData(user);
-    } else if (error) {
-      const { status, message } = error;
-      setNotification({ status, message });
-    }
+    } else if (error) {}
   }, [user, error]);
 
killedBy: Integration tests for fetching, populating, and updating user data in the form component. handles error returned by useUser and sets notification
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="notification"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="formComponentWrapper"
    >

[Killed] ObjectLiteral
src/components/Form/Form.tsx:28:23
       setFormData(user);
     } else if (error) {
       const { status, message } = error;
-      setNotification({ status, message });
+      setNotification({});
     }
   }, [user, error]);
killedBy: Integration tests for fetching, populating, and updating user data in the form component. handles error returned by useUser and sets notification
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="notification"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="formComponentWrapper"
    >

[Killed] BlockStatement
src/components/Form/Form.tsx:32:47
     }
   }, [user, error]);
 
-  const handleChange = (e: FormFieldEvent) => {
-    const { name, value } = e.target;
-
-    const validate = validators[name];
-    if (validate) {
-      const errorMsg = validate(value);
-      setErrors((prev) => ({ ...prev, [name]: errorMsg || '' }));
-      if (!errorMsg) {
-        setFormData((prev) => ({ ...prev, [name]: value }));
-      }
-    } else {
-      setFormData((prev) => ({ ...prev, [name]: value }));
-    }
-  };
+  const handleChange = (e: FormFieldEvent) => {};
 
   const onHandleSubmit = async (event: FormEvent<HTMLFormElement>) => {
killedBy: Integration tests for fetching, populating, and updating user data in the form component. submits the form and displays success notification
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,10 +4,10 @@
      "address": Object {
        "city": "Gwenborough",

[Killed] ConditionalExpression
src/components/Form/Form.tsx:36:9
     const { name, value } = e.target;
 
     const validate = validators[name];
-    if (validate) {
+    if (false) {
       const errorMsg = validate(value);
       setErrors((prev) => ({ ...prev, [name]: errorMsg || '' }));
killedBy: Integration tests for fetching, populating, and updating user data in the form component. calls validator and sets error when validation fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ""

Number of calls: 0

[Killed] ConditionalExpression
src/components/Form/Form.tsx:36:9
     const { name, value } = e.target;
 
     const validate = validators[name];
-    if (validate) {
+    if (true) {
       const errorMsg = validate(value);
       setErrors((prev) => ({ ...prev, [name]: errorMsg || '' }));
killedBy: Integration tests for fetching, populating, and updating user data in the form component. submits the form and displays success notification
statusReason: TypeError: validate is not a function

[Killed] ConditionalExpression
src/components/Form/Form.tsx:38:47
     const validate = validators[name];
     if (validate) {
       const errorMsg = validate(value);
-      setErrors((prev) => ({ ...prev, [name]: errorMsg || '' }));
+      setErrors((prev) => ({ ...prev, [name]: true }));
       if (!errorMsg) {
         setFormData((prev) => ({ ...prev, [name]: value }));
killedBy: Integration tests for fetching, populating, and updating user data in the form component. calls validator and sets error when validation fails
statusReason: TestingLibraryElementError: Unable to find an element with the text: This field is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="formComponentWrapper"
    >

[Killed] ConditionalExpression
src/components/Form/Form.tsx:38:47
     const validate = validators[name];
     if (validate) {
       const errorMsg = validate(value);
-      setErrors((prev) => ({ ...prev, [name]: errorMsg || '' }));
+      setErrors((prev) => ({ ...prev, [name]: false }));
       if (!errorMsg) {
         setFormData((prev) => ({ ...prev, [name]: value }));
killedBy: Integration tests for fetching, populating, and updating user data in the form component. calls validator and sets error when validation fails
statusReason: TestingLibraryElementError: Unable to find an element with the text: This field is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="formComponentWrapper"
    >

[Killed] ConditionalExpression
src/components/Form/Form.tsx:39:11
     if (validate) {
       const errorMsg = validate(value);
       setErrors((prev) => ({ ...prev, [name]: errorMsg || '' }));
-      if (!errorMsg) {
+      if (false) {
         setFormData((prev) => ({ ...prev, [name]: value }));
       }
killedBy: Integration tests for fetching, populating, and updating user data in the form component. submits the form and displays success notification
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -5,9 +5,9 @@
        "city": "Gwenborough",
        "street": "Kulas Light",

[Killed] BlockStatement
src/components/Form/Form.tsx:39:22
     if (validate) {
       const errorMsg = validate(value);
       setErrors((prev) => ({ ...prev, [name]: errorMsg || '' }));
-      if (!errorMsg) {
-        setFormData((prev) => ({ ...prev, [name]: value }));
-      }
+      if (!errorMsg) {}
     } else {
       setFormData((prev) => ({ ...prev, [name]: value }));
killedBy: Integration tests for fetching, populating, and updating user data in the form component. submits the form and displays success notification
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -5,9 +5,9 @@
        "city": "Gwenborough",
        "street": "Kulas Light",

[Killed] ArrowFunction
src/components/Form/Form.tsx:40:21
       const errorMsg = validate(value);
       setErrors((prev) => ({ ...prev, [name]: errorMsg || '' }));
       if (!errorMsg) {
-        setFormData((prev) => ({ ...prev, [name]: value }));
+        setFormData(() => undefined);
       }
     } else {
killedBy: phone validation shows an error when changing from valid to invalid phone number
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
src/components/Form/Form.tsx:42:12
       if (!errorMsg) {
         setFormData((prev) => ({ ...prev, [name]: value }));
       }
-    } else {
-      setFormData((prev) => ({ ...prev, [name]: value }));
-    }
+    } else {}
   };
 
killedBy: Integration tests for fetching, populating, and updating user data in the form component. submits the form and displays success notification
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,10 +4,10 @@
      "address": Object {
        "city": "Gwenborough",

[Killed] ArrowFunction
src/components/Form/Form.tsx:43:19
         setFormData((prev) => ({ ...prev, [name]: value }));
       }
     } else {
-      setFormData((prev) => ({ ...prev, [name]: value }));
+      setFormData(() => undefined);
     }
   };
killedBy: Integration tests for fetching, populating, and updating user data in the form component. submits the form and displays success notification
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] ObjectLiteral
src/components/Form/Form.tsx:43:30
         setFormData((prev) => ({ ...prev, [name]: value }));
       }
     } else {
-      setFormData((prev) => ({ ...prev, [name]: value }));
+      setFormData((prev) => ({}));
     }
   };
killedBy: Integration tests for fetching, populating, and updating user data in the form component. submits the form and displays success notification
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] BlockStatement
src/components/Form/Form.tsx:47:71
     }
   };
 
-  const onHandleSubmit = async (event: FormEvent<HTMLFormElement>) => {
-    event.preventDefault();
-
-    const [street, suite, city] = formData.address.split(',').map((part) => part.trim());
-    const updatedUser = { ...formData, address: { street, suite, city } };
-
-    const { status, message } = await updateUser({ id: 1, user: updatedUser });
-
-    setNotification({ status, message });
-
-    setErrors({});
-  };
+  const onHandleSubmit = async (event: FormEvent<HTMLFormElement>) => {};
 
   return (
killedBy: Integration tests for fetching, populating, and updating user data in the form component. submits the form and displays success notification
statusReason: Error: Unable to find an element with the text: /user updated successfully/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="formComponentWrapper"
    >

[Killed] ArrowFunction
src/components/Form/Form.tsx:50:67
   const onHandleSubmit = async (event: FormEvent<HTMLFormElement>) => {
     event.preventDefault();
 
-    const [street, suite, city] = formData.address.split(',').map((part) => part.trim());
+    const [street, suite, city] = formData.address.split(',').map(() => undefined);
     const updatedUser = { ...formData, address: { street, suite, city } };
 
killedBy: Integration tests for fetching, populating, and updating user data in the form component. submits the form and displays success notification
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,12 +1,12 @@
  Object {
    "id": 1,

[Killed] MethodExpression
src/components/Form/Form.tsx:50:77
   const onHandleSubmit = async (event: FormEvent<HTMLFormElement>) => {
     event.preventDefault();
 
-    const [street, suite, city] = formData.address.split(',').map((part) => part.trim());
+    const [street, suite, city] = formData.address.split(',').map((part) => part);
     const updatedUser = { ...formData, address: { street, suite, city } };
 
killedBy: Integration tests for fetching, populating, and updating user data in the form component. submits the form and displays success notification
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,12 +1,12 @@
  Object {
    "id": 1,

[Killed] ObjectLiteral
src/components/Form/Form.tsx:51:49
     event.preventDefault();
 
     const [street, suite, city] = formData.address.split(',').map((part) => part.trim());
-    const updatedUser = { ...formData, address: { street, suite, city } };
+    const updatedUser = { ...formData, address: {} };
 
     const { status, message } = await updateUser({ id: 1, user: updatedUser });
killedBy: Integration tests for fetching, populating, and updating user data in the form component. submits the form and displays success notification
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "id": 1,
    "user": Object {

[Survived] ObjectLiteral
src/components/Form/Form.tsx:68:15
           className={styles.centredFlexContainer}
           flexDirection="column"
           spacing={3}
-          sx={{ padding: 1.5 }}
+          sx={{}}
         >
           {fields.map(({ name, label, placeholder, type }) => (

[Timeout] ArrowFunction
src/components/Form/Form.tsx:70:23
           spacing={3}
           sx={{ padding: 1.5 }}
         >
-          {fields.map(({ name, label, placeholder, type }) => (
-            <FormField
-              key={label}
-              value={formData[name]}
-              errors={errors}
-              handleChange={handleChange}
-              setErrors={setErrors}
-              label={label}
-              placeholder={placeholder}
-              type={type}
-              name={name}
-            />
-          ))}
+          {fields.map(() => undefined)}
 
           <SubmitButton isDisabled={!formData.name || !formData.email || Boolean(errors.email)} />

[Killed] BooleanLiteral
src/components/Form/Form.tsx:84:55
             />
           ))}
 
-          <SubmitButton isDisabled={!formData.name || !formData.email || Boolean(errors.email)} />
+          <SubmitButton isDisabled={!formData.name || formData.email || Boolean(errors.email)} />
         </Grid>
       </form>
killedBy: Submit button disables the save button when form is invalid and enables it when valid
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:

[Killed] ConditionalExpression
src/components/Form/Form.tsx:84:37
             />
           ))}
 
-          <SubmitButton isDisabled={!formData.name || !formData.email || Boolean(errors.email)} />
+          <SubmitButton isDisabled={false} />
         </Grid>
       </form>
killedBy: Submit button disables the save button when form is invalid and enables it when valid
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:

[Killed] ConditionalExpression
src/components/Form/Form.tsx:87:8
           <SubmitButton isDisabled={!formData.name || !formData.email || Boolean(errors.email)} />
         </Grid>
       </form>
-      {notification && (
-        <DynamicNotification setNotification={setNotification} notification={notification} />
-      )}
+      {true}
     </div>
   );
killedBy: Integration tests for fetching, populating, and updating user data in the form component. submits the form and displays success notification
statusReason: Error: Unable to find an element with the text: /user updated successfully/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="formComponentWrapper"
    >

[Killed] ConditionalExpression
src/components/Form/Form.tsx:87:8
           <SubmitButton isDisabled={!formData.name || !formData.email || Boolean(errors.email)} />
         </Grid>
       </form>
-      {notification && (
-        <DynamicNotification setNotification={setNotification} notification={notification} />
-      )}
+      {false}
     </div>
   );
killedBy: Integration tests for fetching, populating, and updating user data in the form component. submits the form and displays success notification
statusReason: Error: Unable to find an element with the text: /user updated successfully/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="formComponentWrapper"
    >
