[Timeout] BlockStatement
src/components/Form/FormField.tsx:31:70
   type,
   name,
 }: FormFieldProps) {
-  const handleEvent = async ({ event, action }: HandleEventProps) => {
-    const { handleInputEvent } = await import('../../helpers/formHelpers');
-    handleInputEvent({ event, action, setErrors });
-  };
+  const handleEvent = async ({ event, action }: HandleEventProps) => {};
   return (
     <Grid size={gridSize} className={styles.formInput}>

[Killed] ConditionalExpression
src/components/Form/FormField.tsx:41:41
         size="small"
         name={name}
         value={value}
-        required={name !== 'address' && name !== 'phone'}
+        required={name !== 'address' && true}
         type={type}
         variant="outlined"
killedBy: phone validation should not be required
statusReason: Error: expect(element).not.toBeRequired()

Received element is required:
  <input aria-invalid="false" autocomplete="false" class="MuiInputBase-input MuiOutlinedInput-input MuiInputBase-inputSizeSmall css-1pzfmz2-MuiInputBase-input-MuiOutlinedInput-input" id=":ri:" name="phone" placeholder="1-222-333-4444" required="" type="tel" value="1-770-736-8031" />

[Killed] EqualityOperator
src/components/Form/FormField.tsx:41:19
         size="small"
         name={name}
         value={value}
-        required={name !== 'address' && name !== 'phone'}
+        required={name === 'address' && name !== 'phone'}
         type={type}
         variant="outlined"
killedBy: phone validation do not to be required
statusReason: Error: expect(element).not.toBeRequired()

Received element is required:

[Timeout] ArrowFunction
src/components/Form/FormField.tsx:48:17
         onChange={handleChange}
         label={label}
         data-testid={name}
-        onBlur={(event) => handleEvent({ event, action: 'blur' })}
+        onBlur={() => undefined}
         onFocus={(event) => handleEvent({ event, action: 'focus' })}
         error={Boolean(errors[name])}

[Timeout] ObjectLiteral
src/components/Form/FormField.tsx:48:40
         onChange={handleChange}
         label={label}
         data-testid={name}
-        onBlur={(event) => handleEvent({ event, action: 'blur' })}
+        onBlur={(event) => handleEvent({})}
         onFocus={(event) => handleEvent({ event, action: 'focus' })}
         error={Boolean(errors[name])}

[Killed] ArrowFunction
src/components/Form/FormField.tsx:49:18
         label={label}
         data-testid={name}
         onBlur={(event) => handleEvent({ event, action: 'blur' })}
-        onFocus={(event) => handleEvent({ event, action: 'focus' })}
+        onFocus={() => undefined}
         error={Boolean(errors[name])}
         helperText={errors[name]}
killedBy: email validation shows and removes the error message appropriately based on input validity
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="MuiFormHelperText-root Mui-error MuiFormHelperText-sizeSmall MuiFormHelperText-contained Mui-focused MuiFormHelperText-filled Mui-required css-2s8ubb-MuiFormHelperText-root" id=":r9:-helper-text">Invalid email format</p> instead

Ignored nodes: comments, script, style
<html>
  <head />
  <body

[Survived] EqualityOperator
src/components/Form/FormField.tsx:53:20
         error={Boolean(errors[name])}
         helperText={errors[name]}
         autoComplete="false"
-        fullWidth={name === 'address'}
+        fullWidth={name !== 'address'}
         multiline={name === 'address'}
       />

[Survived] ConditionalExpression
src/components/Form/FormField.tsx:53:20
         error={Boolean(errors[name])}
         helperText={errors[name]}
         autoComplete="false"
-        fullWidth={name === 'address'}
+        fullWidth={true}
         multiline={name === 'address'}
       />

[Killed] ConditionalExpression
src/components/Form/FormField.tsx:54:20
         helperText={errors[name]}
         autoComplete="false"
         fullWidth={name === 'address'}
-        multiline={name === 'address'}
+        multiline={true}
       />
     </Grid>
killedBy: email validation trims spaces and does not display an error for valid emails with extra spaces
statusReason: Error: expect(element).toHaveValue(test@example.com)

Expected the element to have value:
  test@example.com
Received:
  test@example.com

[Killed] EqualityOperator
src/components/Form/FormField.tsx:54:20
         helperText={errors[name]}
         autoComplete="false"
         fullWidth={name === 'address'}
-        multiline={name === 'address'}
+        multiline={name !== 'address'}
       />
     </Grid>
killedBy: email validation trims spaces and does not display an error for valid emails with extra spaces
statusReason: Error: expect(element).toHaveValue(test@example.com)

Expected the element to have value:
  test@example.com
Received:
  test@example.com
