[Killed] BlockStatement
src/components/Form/SubmitButton.tsx:10:71
   isDisabled: boolean;
 };
 
-export default function SubmitButton({ isDisabled }: SaveButtonProps) {
-  return (
-    <Button
-      variant="contained"
-      disabled={isDisabled}
-      size="medium"
-      type="submit"
-      data-testid="submit-button"
-      className={styles.saveButton}
-      // sx={{
-      //   backgroundColor: isDisabled ? 'rgb(168, 207, 230)' : 'rgb(30, 174, 255)',
-      // }}
-      sx={{
-        backgroundColor: isDisabled ? 'rgb(168, 207, 230)' : 'rgb(30, 174, 255)',
-        '&.Mui-disabled': {
-          backgroundColor: 'rgb(168, 207, 230)',
-        },
-      }}
-    >
-      Submit
-    </Button>
-  );
-}
+export default function SubmitButton({ isDisabled }: SaveButtonProps) {}
 
killedBy: Submit button the submit button triggers the correct function
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="submit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form />
  </div>
</body>

[Killed] StringLiteral
src/components/Form/SubmitButton.tsx:23:62
       //   backgroundColor: isDisabled ? 'rgb(168, 207, 230)' : 'rgb(30, 174, 255)',
       // }}
       sx={{
-        backgroundColor: isDisabled ? 'rgb(168, 207, 230)' : 'rgb(30, 174, 255)',
+        backgroundColor: isDisabled ? 'rgb(168, 207, 230)' : "",
         '&.Mui-disabled': {
           backgroundColor: 'rgb(168, 207, 230)',
killedBy: Submit button should have a bright blue background color when enabled
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: rgb(30, 174, 255);

[Survived] StringLiteral
src/components/Form/SubmitButton.tsx:23:39
       //   backgroundColor: isDisabled ? 'rgb(168, 207, 230)' : 'rgb(30, 174, 255)',
       // }}
       sx={{
-        backgroundColor: isDisabled ? 'rgb(168, 207, 230)' : 'rgb(30, 174, 255)',
+        backgroundColor: isDisabled ? "" : 'rgb(30, 174, 255)',
         '&.Mui-disabled': {
           backgroundColor: 'rgb(168, 207, 230)',

[Killed] ObjectLiteral
src/components/Form/SubmitButton.tsx:24:27
       // }}
       sx={{
         backgroundColor: isDisabled ? 'rgb(168, 207, 230)' : 'rgb(30, 174, 255)',
-        '&.Mui-disabled': {
-          backgroundColor: 'rgb(168, 207, 230)',
-        },
+        '&.Mui-disabled': {},
       }}
     >
killedBy: Submit button should have a light blue background color when disabled
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: rgb(168, 207, 230);

[Killed] StringLiteral
src/components/Form/SubmitButton.tsx:25:28
       sx={{
         backgroundColor: isDisabled ? 'rgb(168, 207, 230)' : 'rgb(30, 174, 255)',
         '&.Mui-disabled': {
-          backgroundColor: 'rgb(168, 207, 230)',
+          backgroundColor: "",
         },
       }}
killedBy: Submit button should have a light blue background color when disabled
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: rgb(168, 207, 230);
