[Killed] BlockStatement
src/components/Notification/index.tsx:12:92
   notification: NotificationInstance;
 };
 
-export default function Notification({ setNotification, notification }: NotificationProps) {
-  const { status, message } = notification;
-  const handleNotification = () => setNotification({ status, message: null });
-
-  return (
-    <Snackbar
-      open={Boolean(message)}
-      onClose={handleNotification}
-      autoHideDuration={2000}
-      data-testid="notification"
-    >
-      <Alert
-        onClose={handleNotification}
-        severity={status === 200 ? 'success' : 'warning'}
-        variant="filled"
-        sx={{ width: '100%' }}
-      >
-        {message}
-      </Alert>
-    </Snackbar>
-  );
-}
+export default function Notification({ setNotification, notification }: NotificationProps) {}
 
killedBy: Notification Component renders the notification with the correct message and severity
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="notification"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
src/components/Notification/index.tsx:14:30
 
 export default function Notification({ setNotification, notification }: NotificationProps) {
   const { status, message } = notification;
-  const handleNotification = () => setNotification({ status, message: null });
+  const handleNotification = () => undefined;
 
   return (
killedBy: Notification Component calls setNotification to clear the message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"message": null, "status": 200}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] EqualityOperator
src/components/Notification/index.tsx:25:19
     >
       <Alert
         onClose={handleNotification}
-        severity={status === 200 ? 'success' : 'warning'}
+        severity={status !== 200 ? 'success' : 'warning'}
         variant="filled"
         sx={{ width: '100%' }}
killedBy: Notification Component renders the notification with the correct message and severity
statusReason: Error: expect(element).toHaveClass("MuiAlert-filledSuccess")

Expected the element to have class:
  MuiAlert-filledSuccess
Received:
  MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation0 MuiAlert-root MuiAlert-colorWarning MuiAlert-filledWarning MuiAlert-filled css-d4or0u-MuiPaper-root-MuiAlert-root

[Killed] ConditionalExpression
src/components/Notification/index.tsx:25:19
     >
       <Alert
         onClose={handleNotification}
-        severity={status === 200 ? 'success' : 'warning'}
+        severity={false ? 'success' : 'warning'}
         variant="filled"
         sx={{ width: '100%' }}
killedBy: Notification Component renders the notification with the correct message and severity
statusReason: Error: expect(element).toHaveClass("MuiAlert-filledSuccess")

Expected the element to have class:
  MuiAlert-filledSuccess
Received:
  MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation0 MuiAlert-root MuiAlert-colorWarning MuiAlert-filledWarning MuiAlert-filled css-d4or0u-MuiPaper-root-MuiAlert-root

[Survived] StringLiteral
src/components/Notification/index.tsx:27:22
         onClose={handleNotification}
         severity={status === 200 ? 'success' : 'warning'}
         variant="filled"
-        sx={{ width: '100%' }}
+        sx={{ width: "" }}
       >
         {message}

[Survived] ObjectLiteral
src/components/Notification/index.tsx:27:13
         onClose={handleNotification}
         severity={status === 200 ? 'success' : 'warning'}
         variant="filled"
-        sx={{ width: '100%' }}
+        sx={{}}
       >
         {message}
