[Killed] StringLiteral
src/components/Form/FormConstants.ts:10:21
   INVALID_PHONE: 'Wrong phone format',
   NAME_REQUIRED: 'Please type your name',
   INVALID_NAME: 'Only letters are allowed',
-  NUMBERS_REQUIRED: 'Please type numbers',
+  NUMBERS_REQUIRED: "",
 };
 
killedBy: phone validation displays an error message for non-numeric characters
statusReason: Error: Found multiple elements with the text: 

Here are the matching elements:

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] Regex
src/components/Form/FormConstants.ts:13:29
   NUMBERS_REQUIRED: 'Please type numbers',
 };
 
-export const emailPattern = /^[\w-.]+@([\w-]+\.)+[\w-]{2,4}$/g;
+export const emailPattern = /^[\w-.]+@([\w-]+\.)+[^\w-]{2,4}$/g;
 export const phonePattern = /\d{1,3}-\d{3}-\d{4}/;
 
killedBy: email validation should validate valid email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: "Invalid email format"

[Killed] Regex
src/components/Form/FormConstants.ts:13:29
   NUMBERS_REQUIRED: 'Please type numbers',
 };
 
-export const emailPattern = /^[\w-.]+@([\w-]+\.)+[\w-]{2,4}$/g;
+export const emailPattern = /^[\w-.]+@([\w-]+\.)+[\W-]{2,4}$/g;
 export const phonePattern = /\d{1,3}-\d{3}-\d{4}/;
 
killedBy: email validation should validate valid email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: "Invalid email format"

[Killed] Regex
src/components/Form/FormConstants.ts:14:29
 };
 
 export const emailPattern = /^[\w-.]+@([\w-]+\.)+[\w-]{2,4}$/g;
-export const phonePattern = /\d{1,3}-\d{3}-\d{4}/;
+export const phonePattern = /\D{1,3}-\d{3}-\d{4}/;
 
 export const initNotification: ErrorInstance = {
killedBy: phone validation should validate too many digits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
src/components/Form/FormConstants.ts:14:29
 };
 
 export const emailPattern = /^[\w-.]+@([\w-]+\.)+[\w-]{2,4}$/g;
-export const phonePattern = /\d{1,3}-\d{3}-\d{4}/;
+export const phonePattern = /\d{1,3}-\d{3}-\d/;
 
 export const initNotification: ErrorInstance = {
killedBy: phone validation should validate missing digits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] ObjectLiteral
src/components/Form/FormConstants.ts:16:48
 export const emailPattern = /^[\w-.]+@([\w-]+\.)+[\w-]{2,4}$/g;
 export const phonePattern = /\d{1,3}-\d{3}-\d{4}/;
 
-export const initNotification: ErrorInstance = {
-  status: null,
-  message: null,
-};
+export const initNotification: ErrorInstance = {};
 
 export const initialUser: FormFieldsData = {

[Survived] ObjectLiteral
src/components/Form/FormConstants.ts:21:44
   message: null,
 };
 
-export const initialUser: FormFieldsData = {
-  name: '',
-  email: '',
-  phone: '',
-  address: '',
-};
+export const initialUser: FormFieldsData = {};
 
 type FieldsArray = {

[Survived] StringLiteral
src/components/Form/FormConstants.ts:23:10
 
 export const initialUser: FormFieldsData = {
   name: '',
-  email: '',
+  email: "Stryker was here!",
   phone: '',
   address: '',

[Timeout] ArrayDeclaration
src/components/Form/FormConstants.ts:34:36
   label: string;
   placeholder: string;
 }[];
-export const fields: FieldsArray = [
-  { name: 'name', type: 'text', label: 'Name', placeholder: 'John Doe' },
-  { name: 'email', type: 'email', label: 'Email', placeholder: 'example@gmail.com' },
-  { name: 'phone', type: 'tel', label: 'Phone number', placeholder: '1-222-333-4444' },
-  { name: 'address', type: 'text', label: 'Address', placeholder: 'Address' },
-];
+export const fields: FieldsArray = [];
 

[Killed] StringLiteral
src/components/Form/FormConstants.ts:35:40
   placeholder: string;
 }[];
 export const fields: FieldsArray = [
-  { name: 'name', type: 'text', label: 'Name', placeholder: 'John Doe' },
+  { name: 'name', type: 'text', label: "", placeholder: 'John Doe' },
   { name: 'email', type: 'email', label: 'Email', placeholder: 'example@gmail.com' },
   { name: 'phone', type: 'tel', label: 'Phone number', placeholder: '1-222-333-4444' },
killedBy: Integration tests for fetching, populating, and updating user data in the form component. submits the form and displays success notification
statusReason: TestingLibraryElementError: Unable to find a label with the text of: /Name/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="formComponentWrapper"
    >

[Killed] StringLiteral
src/components/Form/FormConstants.ts:36:26
 }[];
 export const fields: FieldsArray = [
   { name: 'name', type: 'text', label: 'Name', placeholder: 'John Doe' },
-  { name: 'email', type: 'email', label: 'Email', placeholder: 'example@gmail.com' },
+  { name: 'email', type: "", label: 'Email', placeholder: 'example@gmail.com' },
   { name: 'phone', type: 'tel', label: 'Phone number', placeholder: '1-222-333-4444' },
   { name: 'address', type: 'text', label: 'Address', placeholder: 'Address' },
killedBy: email validation trims spaces and does not display an error for valid emails with extra spaces
statusReason: Error: expect(element).toHaveValue(test@example.com)

Expected the element to have value:
  test@example.com
Received:
  test@example.com

[Timeout] StringLiteral
src/components/Form/FormConstants.ts:36:11
 }[];
 export const fields: FieldsArray = [
   { name: 'name', type: 'text', label: 'Name', placeholder: 'John Doe' },
-  { name: 'email', type: 'email', label: 'Email', placeholder: 'example@gmail.com' },
+  { name: "", type: 'email', label: 'Email', placeholder: 'example@gmail.com' },
   { name: 'phone', type: 'tel', label: 'Phone number', placeholder: '1-222-333-4444' },
   { name: 'address', type: 'text', label: 'Address', placeholder: 'Address' },

[Killed] StringLiteral
src/components/Form/FormConstants.ts:37:40
 export const fields: FieldsArray = [
   { name: 'name', type: 'text', label: 'Name', placeholder: 'John Doe' },
   { name: 'email', type: 'email', label: 'Email', placeholder: 'example@gmail.com' },
-  { name: 'phone', type: 'tel', label: 'Phone number', placeholder: '1-222-333-4444' },
+  { name: 'phone', type: 'tel', label: "", placeholder: '1-222-333-4444' },
   { name: 'address', type: 'text', label: 'Address', placeholder: 'Address' },
 ];
killedBy: Integration tests for fetching, populating, and updating user data in the form component. updates form data when no validator exists
statusReason: TestingLibraryElementError: Unable to find a label with the text of: /Phone number/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="formComponentWrapper"
    >

[Survived] StringLiteral
src/components/Form/FormConstants.ts:37:69
 export const fields: FieldsArray = [
   { name: 'name', type: 'text', label: 'Name', placeholder: 'John Doe' },
   { name: 'email', type: 'email', label: 'Email', placeholder: 'example@gmail.com' },
-  { name: 'phone', type: 'tel', label: 'Phone number', placeholder: '1-222-333-4444' },
+  { name: 'phone', type: 'tel', label: 'Phone number', placeholder: "" },
   { name: 'address', type: 'text', label: 'Address', placeholder: 'Address' },
 ];

[Killed] ObjectLiteral
src/components/Form/FormConstants.ts:38:3
   { name: 'name', type: 'text', label: 'Name', placeholder: 'John Doe' },
   { name: 'email', type: 'email', label: 'Email', placeholder: 'example@gmail.com' },
   { name: 'phone', type: 'tel', label: 'Phone number', placeholder: '1-222-333-4444' },
-  { name: 'address', type: 'text', label: 'Address', placeholder: 'Address' },
+  {},
 ];
 
killedBy: Integration tests for fetching, populating, and updating user data in the form component. renders component using mocked useUser
statusReason: TestingLibraryElementError: Unable to find an element with the display value: Kulas Light, Apt. 556, Gwenborough.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="formComponentWrapper"
    >
